package com.neyd.cookbook.util;


/**
 * Created by Женя on 03.12.2015.
 */
public class RecipeGenerator {
    public static String[] nameOfRecipe = {
            "Тонкі млинці на сироватці",
            "Рулет із лаваша з сирною начинкою",
            "Салат з капусти з куркою і яєчними млинцями",
            "Салат з квасолею та печінкою",
            "Лінива шуба"
    };

    public static String[] description = {
            "Сироватка – 3 ст.;\n" +
                    "Яйця – 3 шт;\n" +
                    "Цукор – 3 ст.л;\n" +
                    "Сіль – 1 ч.л без гірки;\n" +
                    "Борошно – 2 ст.;\n" +
                    "Олія – 3 ст.л.",
            "Лаваш – 2 шт розміром 30х30 см;\n" +
                    "Сир – 300 гр;\n" +
                    "Часник – 1 зубець;\n" +
                    "Майонез – 3-4 ст.л;\n" +
                    "Сіль,\n" +
                    "Перець, подрібнена зелень.",
            "Яйця – 2 шт;\n" +
                    "Молоко – 2 ст.л;\n" +
                    "Куряче філе – 250-300 гр;\n" +
                    "Капуста – 300 гр;",
            "Печінка – 200 гр;\n" +
                    "Яйця – 2 шт;\n" +
                    "Огірки мариновані – 2 шт;\n" +
                    "Цибуля – 1 шт;\n" +
                    "Морква – 1 шт;\n" +
                    "Квасоля консервована – ½ півлітр. банки;",
            "Філе оселедця – 100 гр;\n" +
                    "Яйця – 5 шт;\n" +
                    "Буряк – 1 шт( невеликий);\n" +
                    "Цибуля – 0,5 шт (невелика);\n" +
                    "Майонез – 3 – 4 ст.л;\n" +
                    "Сіль, перець, петрушка.\n"


    };

    public static String[] product = {
            "Яйця",
            "Буряк",
            "Цибуля",
            "Майонез",
            "Сіль",
            "Огірки",
            "Морква",
            "Квасоля",
            "Молоко",
            "Куряче філе",
            "Капуста",
            "Сир",
            "Часник",
            "Цукор",
            "Сіль",
            "Борошно",
            "Олія",
            "Перець"

    };

    private RecipeGenerator() {}

}
